Repository: BlackHoleJet/analyze
Catalog: doc/source/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Waarp Analyze's documentation
fr: Documentation de Waarp Analyze

source: Waarp Analyze is a tool that gathers information about Waarp instances and about the server it runs on.
fr: Waarp Analyze est un outil de collecte d'inormations sur les instances Waarp installées et sur le serveur sur lequel elles tournent.

source: It is useful to generate reports about the state of the system when a transfer is in error, or to verify the global configuration.
fr: Cet outil est utile pour générer des rapports sur l'état d'un système quand un transfert est en erreur, ou pour vérifier la configuration globale.

source: Reports are generated in Restructured Text and can be converted to any format supported by docutils_ (or pandoc_, or any RST converter).
fr: Les rapports sont générés au format ReStructured Text et peuvent être convertis vers tous les formats supportés par docutils_ (ou pandoc_, ou tout convertisseur RST).

source: **Compatibility**
fr: **Compatibilité**

source: For now, Waarp Analyze *only* runs on GNU/Linux 32 and 64 bits. It *only* detects **running instances of Waarp R66 Server**.
fr: Pour le moment, Waarp Analyze ne fonctionne *que* sur les systèmes GNU/Linux 32 et 64 bits. Il ne détecte **que les instances en cours d'exécution de Waarp R66 Server**.

source: Links
fr: Liens

source: `Source code <https://alm.waarp.fr/projects/waarp-analyze/repository>`__
fr: `Code source <https://alm.waarp.fr/projects/waarp-analyze/repository>`__

source: `Download <https://dl.waarp.org/dist/waarp-analyze/>`__
fr: `Téléchargements <https://dl.waarp.org/dist/waarp-analyze/>`__

source: `Documentation <https://doc.waarp.org/waarp-analyze/latest/en>`__
fr: `Documentation <https://doc.waarp.org/waarp-analyze/latest/fr>`__

source: License
fr: Licence

source: Waarp Analyze is provided under the terms of the MIT license.
fr: Waarp Analyze est fournis selon les termes de la licence MIT.

source: Contents
fr: Contenu
