Repository: BlackHoleJet/analyze
Catalog: doc/source/locale/*/LC_MESSAGES/use.po
Languages: fr

source: Usage
fr: Utilisation

source: Execution
fr: Exécution

source: :program:`waarp-analyze` accepts the following options
fr: :program:`waarp-analyze` accepte les arguments suivants :

source: Verbose output. All information about the collect of data and the generation of the report is written on the standard error.
fr: Sortie verbeuse. Toutes les informations sur la collecte de données et la génération des rapports sont écrites sur la sortie d'erreur.

source: Prints version and exits
fr: Écrit la version et termine.

source: Write report to this location. Use '-' for standard output (default is standard output)
fr: Écrit le rapport à cet emplacement. Utilisez '-' pour la sortie standard (par défaut, la sortie standard est utilisée)

source: Limit analyze to this Waarp instance
fr: Limiter l'analyse à cette instance

source: Show the help message
fr: Écrit un message d'aide

source: Depending on which system user runs :program:`waarp-analyze`, it might not have the rights to collect all information. It might not have the required UNIX permissions.
fr: Selon l'utilisateur système qui lance :program:`waarp-analyze`, celui-ci peut ne pas avoir les droits nécessaires pour collecter toutes les informations

source: To work around that limitation, make sure you run :program:`waarp-analyze` with the same user that runs Waarp instances.
fr: Pour contourner cette limitation, assurez-vous de lancer :program:`waarp-analyze` avec le même utilisateur système que celui qui lance les instances Waarp.

source: One-Time Run
fr: Usage unique

source: Waarp Analyze can be run when needed to get a full picture of the of an instance configuration along with its system environment.
fr: Waarp Analyze peut être lancé en cas de besoin pour obtenir un panorama global de la configuration d'une instance et de son environnement système.

source: It is useful to debug the configuration or to have all the elements necessary to fine-tune it.
fr: Ça peut être utile pour débugger la configuration d'une instance ou pour avoir toutes les informations nécessaires pour l'affiner.

source: Generate HTML reports
fr: Générer des rapport HTML

source: Waarp Analyze generates its report in the `ReStructured Text`_ format.
fr: Waarp Analyze génère ses rapports au format `ReStructured Text`_.

source: This report can be used as is, or converted to HTML, or any format supported by the various converter that exist (docutils_, pandoc_, etc.).
fr: Les rapports peuvent être utilisés tels quels, ou convertis au format HTML, ou dans tous les formats supportés par les convertisseurs existants (docutils_, pandoc_, etc.).

source: To generate a HTML report, you can run the following command:
fr: Pour générer un rapport HTML, utilisez les commande suivantes :

source: or use the one-liner :
fr: ou en une ligne :

source: Run as error task in Waarp R66
fr: Lancer en traitement d'erreur dans Waarp R66

source: It can be useful to run Waarp Analyze as a error task in Waarp R66 to ease the debug of failed transfers by capturing the system environment when the error occured.
fr: Il peut être utile d'exécuter Waarp Analyze en traitement d'erreur pour faciliter l'analyse des transferts en erreur en capturant l'environnement au moment où l'erreur est survenue.

source: To do so, add the following XML to your transfer rules in a `<rerrortasks>` and/or `<serrortasks>` (whether you want to run it on the receiver and/or the sender of the file):
fr: Pour cela, ajoutez le bloc XML suivant à vos règles de transfert dans les blocs `<rerrortasks>` et/ou `<serrortasks>` (selon que vous voulez l'exécuter sur l'émetteur et/ou le récepteur du fichier) :
